openfoam/run/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       2028944;
    }
    inlet
    {
        type            patch;
        nFaces          1250;
        startFace       2033944;
    }
    outlet
    {
        type            patch;
        nFaces          1250;
        startFace       2035194;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       2036444;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          220060;
        startFace       2038944;
    }
)

// ************************************************************************* //
